{"config": [{"config": {"padding": "valid", "kernel_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "use_bias": true, "bias_constraint": null, "kernel_size": [3, 3], "batch_input_shape": [null, 64, 64, 3], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "kernel_constraint": null, "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "name": "conv2d_1", "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"padding": "valid", "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"padding": "valid", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "name": "conv2d_2", "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"padding": "valid", "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "noise_shape": null, "seed": null, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"padding": "valid", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "name": "conv2d_3", "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"padding": "valid", "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_3", "data_format": "channels_last", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 128, "bias_regularizer": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_2", "noise_shape": null, "seed": null, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 5, "bias_regularizer": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "activation_5", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.1"}