{"backend": "tensorflow", "config": [{"config": {"kernel_size": [3, 3], "name": "conv2d_1", "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "data_format": "channels_last", "padding": "valid", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "batch_input_shape": [null, 64, 64, 3], "dtype": "float32", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "strides": [1, 1], "filters": 64}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"padding": "valid", "trainable": true, "name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"kernel_size": [3, 3], "name": "conv2d_2", "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "data_format": "channels_last", "padding": "valid", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "filters": 32, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"padding": "valid", "trainable": true, "name": "max_pooling2d_2", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "seed": null, "rate": 0.25, "noise_shape": null, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"kernel_size": [3, 3], "name": "conv2d_3", "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "data_format": "channels_last", "padding": "valid", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "filters": 64, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"padding": "valid", "trainable": true, "name": "max_pooling2d_3", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "units": 128, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "seed": null, "rate": 0.5, "noise_shape": null, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "units": 5, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_5", "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.1.1"}