{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.1", "config": [{"class_name": "Conv2D", "config": {"strides": [1, 1], "dtype": "float32", "kernel_size": [3, 3], "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "name": "conv2d_1", "batch_input_shape": [null, 64, 64, 3], "activation": "linear", "padding": "valid", "filters": 64, "use_bias": true, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1"}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.75, "name": "dropout_1", "trainable": true, "noise_shape": null}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "center": true, "trainable": true, "gamma_regularizer": null, "beta_constraint": null, "name": "batch_normalization_1", "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activation": "linear", "padding": "valid", "filters": 32, "use_bias": true, "data_format": "channels_last", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2"}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.25, "name": "dropout_2", "trainable": true, "noise_shape": null}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "center": true, "trainable": true, "gamma_regularizer": null, "beta_constraint": null, "name": "batch_normalization_2", "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activation": "linear", "padding": "valid", "filters": 64, "use_bias": true, "data_format": "channels_last", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_3"}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "center": true, "trainable": true, "gamma_regularizer": null, "beta_constraint": null, "name": "batch_normalization_3", "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "units": 128, "bias_regularizer": null, "bias_constraint": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.5, "name": "dropout_3", "trainable": true, "noise_shape": null}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "center": true, "trainable": true, "gamma_regularizer": null, "beta_constraint": null, "name": "batch_normalization_4", "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Dense", "config": {"use_bias": true, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "units": 5, "bias_regularizer": null, "bias_constraint": null, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_5", "trainable": true}}]}